testCase1_potentialFoam/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version    2.0;
	format     ascii;
	class      dictionary;
	object     snappyHexMeshDict;
}


	castellatedMesh  true;
	snap               true;
	addLayers         true;

geometry
{

	hull16_0deg.obj
	{
		type triSurfaceMesh;
		name ship;

		regions
		{
			bow
			{
				name ship_bow;
			}
			deck
			{
				name ship_deck;
			}
			side
			{
				name ship_side;
			}
			stern	
			{
				name ship_stern;
			}
			hull
			{
				name ship_hull;
			}
		}
	}




}

castellatedMeshControls
{
	maxLocalCells 5000000;
	maxGlobalCells 2000000000;
	minRefinementCells 10;
	maxLoadUnbalance 0.1;
	nCellsBetweenLevels 3;
	resolveFeatureAngle 45;
	locationInMesh (-1 0.1 -0.1);
	allowFreeStandingZoneFaces false;

	features
	(
		{
			file "hull16_0deg.eMesh";
			level 4;
		}
	);

	refinementSurfaces
	{
		ship
		{
					level (4 4);
			regions
			{
				bow
				{
					level (6 6);
				}
				deck
				{
					level (4 4);
				}
				stern
				{
					level (6 6);
				}
				side
				{
					level (5 5);
				}
				hull
				{
					level (6 6);
				}
			}
		}

	}

	refinementRegions
	{


		ship
		{
			mode distance;
			levels ((0.3 4));
		}
	}

}
snapControls
{
	nSmoothPatch              3;
	nSmoothInternal           30;
	tolerance                 1.0;
	nSolveIter                100;
	nRelaxIter                5;
	nFeatureSnapIter          10;
	detectNearSurfaceSnap     true;
	implicitFeatureSnap       false;
	explicitFeatureSnap       true;
	multiRegionFeatureSnap    false;
}

addLayersControls
{
	meshShrinker displacementMotionSolver;
	solver       displacementLaplacian;
	displacementLaplacianCoeffs
	{
		diffusivity    quadratic inverseDistance 1(wall);
	}

	layers
	{
		ship_hull
		{
			nSurfaceLayers 1;
		}
	}

	relativeSizes true;
	finalLayerThickness 0.7;
	expansionRatio 1.5;
	minThickness 0.001;
	nGrow 0;
	featureAngle 60;
	slipFeatureAngle 30;
	layerTerminationAngle 30;
	nRelaxIter 5;
	nSmoothSurfaceNormals 1;
	nSmoothNormals 3;
	nSmoothThickness 10;
	maxFaceThicknessRatio 0.5;
	maxThicknessToMedialRatio 0.3;
	minMedianAxisAngle 90;
	nBufferCellsNoExtrude 1;
	nLayerIter 50;
	nRelaxedIter 20;
	
}

meshQualityControls
{

#include "meshQualityDict"
}

mergeTolerance 1e-06;
